package org.levelup.lesson6;
// структура данных -> способ хранения данных
// существует две структуры данных: массивы и связанный список
// связанный список- нет готового набора документов (есть только первое и последнее)
// абстрактные структуры данных: множество, мап, дерево ( они все равно либо массив либо связанный список)
// бинарное дерево - всего 2 листа (BST)
// нотация большого О (big O notation) - > сложность алгоритма
//самый лучший способ сортировки -> O(nlogn)
//O(n2) - пузырьковая сортировка
// Алгоритм Дейкстра - нахождения пути на грефе (минимальний способ из точки А в точку В)
public class Info {

}

